dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
/* USER CODE BEGIN Header */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used 
  * @retval None
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <math.h>
#include <float.h>
#include <stdlib.h>
#include "WS2812_Lib.h"
#include "stm32f411e_discovery.h"
#include "stm32f411e_discovery_accelerometer.h"
#include "FreeRTOS.h"
#include "task.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

SPI_HandleTypeDef hspi5;
DMA_HandleTypeDef hdma_spi5_tx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim9;
TIM_HandleTypeDef htim10;
DMA_HandleTypeDef hdma_tim4_ch2;

UART_HandleTypeDef huart6;

osThreadId defaultTaskHandle;
osThreadId sensorTaskHandle;
osThreadId controlTaskHandle;
osThreadId commTaskHandle;
osThreadId idleTaskHandle;
osThreadId ledTaskHandle;
osThreadId applicationTaskHandle;
/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

#define COMPASS_X_MAX 702
#define COMPASS_X_MIN -358
#define COMPASS_Y_MAX 293
#define COMPASS_Y_MIN -829
#define COMPASS_Z_MAX 845
#define COMPASS_Z_MIN -282

#define NORMALVOLTAGE_MOT 1.4
#define LOWVOLTAGE_MOT 1.18

#define NORMALVOLTAGE_LOGIC 1.1
#define LOWVOLTAGE_LOGIC 0.8

static volatile uint32_t ADC_Buf[6];
static volatile uint32_t ADC_Values[6];

static uint16_t mot1Cntr, mot1CntrPrev = 0; //L1
static uint16_t mot2Cntr, mot2CntrPrev = 0; //L2
static uint16_t mot3Cntr, mot3CntrPrev = 0; //L3
static uint16_t mot4Cntr, mot4CntrPrev = 0; //R1
static uint16_t mot5Cntr, mot5CntrPrev = 0; //R2
static uint16_t mot6Cntr, mot6CntrPrev = 0; //R3
static volatile uint8_t mot1Dir = 0; //L1
static volatile uint8_t mot2Dir = 0; //L2
static volatile uint8_t mot3Dir = 0; //L3
static volatile uint8_t mot4Dir = 0; //R1
static volatile uint8_t mot5Dir = 0; //R2
static volatile uint8_t mot6Dir = 0; //R3

typedef struct {
    const GPIO_TypeDef* port;
    const uint16_t pin;
} GPIO_t;

#define GPIO_PIN(__port__, __pin__) {   \
    .port = GPIO ## __port__,           \
    .pin  = GPIO_PIN_ ## __pin__        \
}

typedef struct
{
    const GPIO_t control;
    volatile uint32_t * const delayRegister;

    uint32_t counter;
    uint32_t start;
    uint32_t end;
    uint32_t length;

    uint16_t debounceCounter;
    float rawDistance;
    float previousDistance;
    float filteredDistance;
} Ultrasound_t;

#define DEFINE_ULTRASOUND(ctrlPort, ctrlPin, timer) \
{                                                               \
    .control = GPIO_PIN(ctrlPort, ctrlPin),                     \
    .delayRegister = &(timer),                                  \
    .counter = 0u,                                              \
    .start = 0u,                                                \
    .end = 0u,                                                  \
    .length = 0u,                                               \
    .debounceCounter = 1000u,                                   \
    .rawDistance = 0.0f,                                        \
    .previousDistance = 0.0f,                                   \
    .filteredDistance = 0.0f                                    \
}

static Ultrasound_t sensors[4] =
{
    DEFINE_ULTRASOUND(A, 4, TIM10->CNT),
    DEFINE_ULTRASOUND(A, 5, TIM10->CNT),
    DEFINE_ULTRASOUND(C, 4, TIM10->CNT),
    DEFINE_ULTRASOUND(C, 5, TIM10->CNT)
};

static void ultrasound_onSenseStart(Ultrasound_t* sensor, uint32_t counter)
{
    sensor->counter++;
    sensor->start = counter;
}

static void ultrasound_onSenseEnd(Ultrasound_t* sensor, uint32_t counter)
{
    sensor->counter++;
    sensor->end = counter;
    if (counter > sensor->start)
    {
        sensor->length = counter - sensor->start;
    }
    else
    {
        sensor->length = (counter + 65536u) - sensor->start;
    }
}

static void ultrasound_startMeasurement(uint8_t sensorIdx)
{
    uint32_t currentTimerCounter = *(sensors[sensorIdx].delayRegister);
    uint32_t targetCounter = currentTimerCounter + 2u;  /* +2 so the delay is between 10 and 20us */

    /* Generate a trigger pulse between 10 and 20us (timer resolution limit) */
    HAL_GPIO_WritePin(sensors[sensorIdx].control.port, sensors[sensorIdx].control.pin, GPIO_PIN_SET);
    while (*(sensors[sensorIdx].delayRegister) != targetCounter);
    HAL_GPIO_WritePin(sensors[sensorIdx].control.port, sensors[sensorIdx].control.pin, GPIO_PIN_RESET);
}

typedef struct {
    const GPIO_t ctrlA;
    const GPIO_t ctrlB;
    volatile uint32_t * const speedControlRegister;
} MotorControl_t;

#define MOTOR_LEFT1 (0u)
#define MOTOR_LEFT2 (1u)
#define MOTOR_LEFT3 (2u)

#define MOTOR_RIGHT1 (3u)
#define MOTOR_RIGHT2 (4u)
#define MOTOR_RIGHT3 (5u)

static const MotorControl_t motors[] =
{
    /* Left side motors */
    {
        .ctrlA = GPIO_PIN(B, 15),
        .ctrlB = GPIO_PIN(D, 11),
        .speedControlRegister = &(TIM1->CCR1)
    },
    {
        .ctrlA = GPIO_PIN(C, 13),
        .ctrlB = GPIO_PIN(C, 14),
        .speedControlRegister = &(TIM1->CCR2)
    },
    {
        .ctrlA = GPIO_PIN(C, 10),
        .ctrlB = GPIO_PIN(C, 11),
        .speedControlRegister = &(TIM1->CCR3)
    },

    /* Right side motors */
    {
        .ctrlA = GPIO_PIN(A, 6),
        .ctrlB = GPIO_PIN(A, 7),
        .speedControlRegister = &(TIM1->CCR4)
    },
    {
        .ctrlA = GPIO_PIN(A,  9),
        .ctrlB = GPIO_PIN(A, 10),
        .speedControlRegister = &(TIM2->CCR1)
    },
    {
        .ctrlA = GPIO_PIN(D, 12),
        .ctrlB = GPIO_PIN(D, 13),
        .speedControlRegister = &(TIM2->CCR2)
    }
};

static void MotorControl_SetSpeed(const MotorControl_t* motor, int32_t speed)
{
    const uint32_t motorScaling = 4800 / 100;

    if (speed >= 0)
    {
        HAL_GPIO_WritePin(motor->ctrlA.port, motor->ctrlA.pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(motor->ctrlB.port, motor->ctrlB.pin, GPIO_PIN_RESET);
        *(motor->speedControlRegister) = speed * motorScaling;
    }
    else
    {
        HAL_GPIO_WritePin(motor->ctrlA.port, motor->ctrlA.pin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(motor->ctrlB.port, motor->ctrlB.pin, GPIO_PIN_SET);
        *(motor->speedControlRegister) = -speed * motorScaling;
    }
}

typedef struct
{
    float P;
    float I;
    float D;

    float umax;
    float umin;

    float integrator;
    float previousError;

    float unsaturatedControlSignal;
    float saturatedControlSignal;
} PID_t;

#define DEFINE_PID(p, i, d, min, max)   \
{                                       \
    .P = p,                             \
    .I = i,                             \
    .D = d,                             \
    .umax = max,                        \
    .umin = min,                        \
    .integrator = 0.0f,                 \
    .previousError = 0.0f,              \
    .unsaturatedControlSignal = 0.0f,   \
    .saturatedControlSignal = 0.0f      \
}

static PID_t speedControllers[] =
{
    /* Left side motors */
    DEFINE_PID(750.0f, 10.0f, 0.0f, -100.0f, 100.0f),
    DEFINE_PID(750.0f, 10.0f, 0.0f, -100.0f, 100.0f),
    DEFINE_PID(750.0f, 10.0f, 0.0f, -100.0f, 100.0f),

    /* Right side motors */
    DEFINE_PID(750.0f, 10.0f, 0.0f, -100.0f, 100.0f),
    DEFINE_PID(750.0f, 10.0f, 0.0f, -100.0f, 100.0f),
    DEFINE_PID(750.0f, 10.0f, 0.0f, -100.0f, 100.0f),
};

static PID_t positionController = DEFINE_PID(0.01f, 0.0f, 0.0f, -FLT_MAX, FLT_MAX);

static float saturateFloat(float i, float min, float max);

static float Controller_PID(PID_t* context, float reference, float feedback)
{
    float error = reference - feedback;

    /* Proportional */
    float p = context->P * error;

    /* Differential */
    float d = context->D * (context->previousError - error);
    context->previousError = error;

    /* Integral - using the FOXBORO structure */
    float i = context->integrator;

