dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
    wheelL1Odometer_m_prev = wheelL1Odometer_m;
    wheelL2Odometer_m_prev = wheelL2Odometer_m;
    wheelL3Odometer_m_prev = wheelL3Odometer_m;
    wheelR1Odometer_m_prev = wheelR1Odometer_m;
    wheelR2Odometer_m_prev = wheelR2Odometer_m;
    wheelR3Odometer_m_prev = wheelR3Odometer_m;
    mot1CntrPrev = mot1Cntr;
    mot2CntrPrev = mot2Cntr;
    mot3CntrPrev = mot3Cntr;
    mot4CntrPrev = mot4Cntr;
    mot5CntrPrev = mot5Cntr;
    mot6CntrPrev = mot6Cntr;
    
    if (cycleCounter <= 6 && (cycleCounter % 2) == 0)
    {
        uint8_t sensorIdx = cycleCounter / 2;

        ultrasound_startMeasurement(sensorIdx);
    }

    if (cycleCounter % 4 == 0){
      /* Read Acceleration*/
      float accelerometerBuffer[3];
      BSP_ACCELERO_GetXYZ(accelerometerBuffer);

      accX = accelerometerBuffer[0];
      accY = accelerometerBuffer[1];
      accZ = accelerometerBuffer[2];
      
      accXFiltered = filter2(accXFiltered, accX, 0.2);
      accYFiltered = filter2(accYFiltered, accY, 0.2);
      accZFiltered = filter2(accZFiltered, accZ, 0.2);
     
      fNormAcc = sqrtf((accXFiltered*accXFiltered)+(accYFiltered*accYFiltered)+(accZFiltered*accZFiltered));
        
      fSinRoll = accYFiltered/fNormAcc;
      fCosRoll = sqrtf(1.0-(fSinRoll * fSinRoll));
      fSinPitch = accXFiltered/fNormAcc;
      fCosPitch = sqrtf(1.0-(fSinPitch * fSinPitch));
        
      if ( fSinRoll >0) {
        if (fCosRoll>0) roll = acosf(fCosRoll)*180/M_PI;
        else            roll = acosf(fCosRoll)*180/M_PI + 180;
      }
      else {
        if (fCosRoll>0) roll = acosf(fCosRoll)*180/M_PI + 360;
        else            roll = acosf(fCosRoll)*180/M_PI + 180;
      }
       
      if ( fSinPitch >0) {
        if (fCosPitch>0) pitch = acosf(fCosPitch)*180/M_PI;
        else             pitch = acosf(fCosPitch)*180/M_PI + 180;
      }
      else {
        if (fCosPitch>0) pitch = acosf(fCosPitch)*180/M_PI + 360;
        else             pitch = acosf(fCosPitch)*180/M_PI + 180;
      }

      if (roll >=360)  roll = 360 - roll;
      if (pitch >=360) pitch = 360 - pitch;
      
      /* Read Magnetometer*/
      float compassBuffer[3];
      LSM303DLHC_MagReadXYZ(compassBuffer);
      compassX = compassBuffer[0];
      compassY = compassBuffer[1];
      compassZ = compassBuffer[2];
    }
  }
  /* USER CODE END StartSensorTask */
}

/* USER CODE BEGIN Header_StartControlTask */
/**
* @brief Function implementing the controlTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartControlTask */
void StartControlTask(void const * argument)
{
  /* USER CODE BEGIN StartControlTask */
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
        /* Calculate speed reference signals */
        reqSpeedLeft = -referenceSpeedLeft;
        reqSpeedRight = referenceSpeedRight;

        nextSpeedLeft = saturateFloat(reqSpeedLeft, currSpeedLeft - speedRampRate, currSpeedLeft + speedRampRate);
        nextSpeedRight = saturateFloat(reqSpeedRight, currSpeedRight - speedRampRate, currSpeedRight + speedRampRate);

        /* Update position controller */
        float l3Speed = Controller_P(&positionController, referenceAngleL3_deg, wheelL3Angle_deg);

        float nextSpeeds[] =
        {
            nextSpeedLeft,
            nextSpeedLeft,
            l3Speed,
            nextSpeedRight,
            nextSpeedRight,
            nextSpeedRight
        };

        currSpeedLeft = nextSpeedLeft;
        currSpeedRight = nextSpeedRight;

        /* Update speed controllers */
        wheelControlSignal[MOTOR_LEFT1] = Controller_PID(&speedControllers[MOTOR_LEFT1], nextSpeeds[MOTOR_LEFT1], wheelL1FiltVelocity_mps);
        wheelControlSignal[MOTOR_LEFT2] = Controller_PID(&speedControllers[MOTOR_LEFT2], nextSpeeds[MOTOR_LEFT2], wheelL2FiltVelocity_mps);
        wheelControlSignal[MOTOR_LEFT3] = Controller_PID(&speedControllers[MOTOR_LEFT3], nextSpeeds[MOTOR_LEFT3], wheelL3FiltVelocity_mps);

        wheelControlSignal[MOTOR_RIGHT1] = Controller_PID(&speedControllers[MOTOR_RIGHT1], nextSpeeds[MOTOR_RIGHT1], wheelR1FiltVelocity_mps);
        wheelControlSignal[MOTOR_RIGHT2] = Controller_PID(&speedControllers[MOTOR_RIGHT2], nextSpeeds[MOTOR_RIGHT2], wheelR2FiltVelocity_mps);
        wheelControlSignal[MOTOR_RIGHT3] = Controller_PID(&speedControllers[MOTOR_RIGHT3], nextSpeeds[MOTOR_RIGHT3], wheelR3FiltVelocity_mps);

        /* Set output signals */
        MotorControl_SetSpeed(&motors[MOTOR_LEFT1], (int32_t) wheelControlSignal[MOTOR_LEFT1]);
        MotorControl_SetSpeed(&motors[MOTOR_LEFT2], (int32_t) wheelControlSignal[MOTOR_LEFT2]);
        MotorControl_SetSpeed(&motors[MOTOR_LEFT3], (int32_t) wheelControlSignal[MOTOR_LEFT3]);

        MotorControl_SetSpeed(&motors[MOTOR_RIGHT1], (int32_t) wheelControlSignal[MOTOR_RIGHT1]);
        MotorControl_SetSpeed(&motors[MOTOR_RIGHT2], (int32_t) wheelControlSignal[MOTOR_RIGHT2]);
        MotorControl_SetSpeed(&motors[MOTOR_RIGHT3], (int32_t) wheelControlSignal[MOTOR_RIGHT3]);

        vTaskDelayUntil(&xLastWakeTime, 20u);
    }
  /* USER CODE END StartControlTask */
}

/* USER CODE BEGIN Header_StartCommTask */
/**
* @brief Function implementing the commTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartCommTask */
void StartCommTask(void const * argument)
{
  /* USER CODE BEGIN StartCommTask */
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    HAL_UART_Receive_IT(&huart6,receiveBuffer,5);
    
    if ((receiveBuffer[0] == 0xFF) && (receiveBuffer[1] <=100) && (receiveBuffer[2] <=180)){
      //referenceSpeedOrig = receiveBuffer[1] / 10.0;
      //referenceSpeed = calcSpdRef_LUT(referenceSpeedOrig);
      referenceSpeed = receiveBuffer[1] / 667.0;
      referenceAngle = receiveBuffer[2] * 2.0;
      buttonState = receiveBuffer[3];
      messageCounter = receiveBuffer[4];
      if (messageCounter != messageCounterPrev){
        timeStamp = HAL_GetTick();
        messageCounterPrev = messageCounter;
      }
    }    
    
    timeOutGuard = HAL_GetTick() - timeStamp;
    if (timeOutGuard > timeOutGuardMax){
      timeOutGuardMax = timeOutGuard;
    }
    
    if ((timeOutGuard) > 1000){
      referenceSpeed = 0;
      referenceAngle = 0;
      buttonState = 0;
    }
    
    vTaskDelayUntil(&xLastWakeTime, 20u);
  }
  /* USER CODE END StartCommTask */
}

/* USER CODE BEGIN Header_StartIdleTask */
/**
* @brief Function implementing the idleTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartIdleTask */
void StartIdleTask(void const * argument)
{
  /* USER CODE BEGIN StartIdleTask */
  /* Infinite loop */
  for(;;)
  {
    osDelay(1000);
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
  }
  /* USER CODE END StartIdleTask */
}

/* USER CODE BEGIN Header_StartLedTask */
/**
* @brief Function implementing the ledTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartLedTask */
void StartLedTask(void const * argument)
{
  /* USER CODE BEGIN StartLedTask */
  uint8_t cycleCounter=0;
  uint32_t roundCounter = 0;
  int8_t bluetoothBlinkCounter = 0;
  int8_t battery1BlinkCounter = 0;
  int8_t battery2BlinkCounter = 0;
  
  float voltageFullRange_Mot = NORMALVOLTAGE_MOT - LOWVOLTAGE_MOT;
  float voltageFullRange_Logic = NORMALVOLTAGE_LOGIC - LOWVOLTAGE_LOGIC;
  float voltageInRange = 0;
  float voltageRatio = 0;
  float cellVoltage = 0;
  
  WS2812_One_RGB(0,(WS2812_RGB_t){0,10,0},0);
  WS2812_One_RGB(1,(WS2812_RGB_t){10,10,10},0);
  WS2812_One_RGB(2,(WS2812_RGB_t){10,0,0},0);
  WS2812_One_RGB(3,(WS2812_RGB_t){10,10,0},0);
  WS2812_One_RGB(4,(WS2812_RGB_t){0,0,10},1);
  /* Infinite loop */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  for(;;)
  {
    cycleCounter++;
    HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
    
    if (bumperActive){
      WS2812_All_RGB((WS2812_RGB_t){10,0,0},0);
    }
    else if (ultrasonicActive){
      WS2812_All_RGB((WS2812_RGB_t){0,10,0},0);
    }
    else {
      WS2812_All_RGB((WS2812_RGB_t){0,0,0},0);
      WS2812_One_RGB(((roundCounter%12)+4),(WS2812_RGB_t){0,0,10},0);
      roundCounter++;
      WS2812_Revvy_Shift_Right(0);
    }
    
    
    
